SOAPe/Templates/EWS/SetUserPhoto.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <SetUserPhoto xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
      <Email>
        <!--FIELD:Email;string;-->
      </Email>
      <Content>
        <!--FIELD:SizeRequested;string;HR360x360-->
      </Content>
    </SetUserPhoto>
  </soap:Body>
</soap:Envelope>